# Найти сумму чисел ряда 1,2,3...,60 с использованием функции нахождения суммы. Использовать локальные переменные
print('Первая задача')
a = list(range(1, 61))
sum(a)
print('Сумма чисел ряда от 1 - 60 равна: ', sum(a))